/* 1. Выведите в консоль все числа в промежутке от 10 до 1000, у которых предпоследняя цифра четная. */

for (let i = 10; i <= 1000; i++) {
    const penultimateDigit = Math.floor((i % 100) / 10); // Извлекаем предпоследнюю цифру
    if (penultimateDigit % 2 === 0) { // Проверяем, четная ли она
        console.log(i);
    }
}

/****************************************************************************************/

/* 2. Дан массив. Удалите из него каждый пятый элемент. */

// способ 1

let arr3 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15];

for (let i = 4; i < arr3.length; i += 4) {
    arr1.splice(i, 1);
}

console.log(arr3); // [1, 2, 3, 4, 6, 7, 8, 9, 11, 12, 13, 14]

// способ 2

let arr4 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15];

let newArr = arr4.filter((_, index) => (index + 1) % 5 !== 0);

console.log(newArr); // [1, 2, 3, 4, 6, 7, 8, 9, 11, 12, 13, 14]

/****************************************************************************************/

/* 3. Дана некоторая переменная с числом:

let num = 5;
Сделайте строку, содержащую столько нулей, сколько указано в переменной. В нашем случае получится такая строка:

'00000' */

// способ 1

function toString (num){
    let res = '';

    for (let i = 1; i <= num; i++ ){
        res += '0'
    }

    console.log(res)
    return res;
}

toString(10)

// способ 2

let num = 5;
let zeros = '0'.repeat(num); // Повторяем символ '0' 5 раз
console.log(zeros); // '00000'

/****************************************************************************************/

/* 4. Дана некоторая строка со словами:

'aaa bbb ccc eee fff'
Удалите из этой строки каждое второе слово. В нашем случае должно получится следующее:

'aaa ccc fff' */

function delStr (str){

    let arr = str.split(' ').filter((_, index) => ((index % 2 === 0)));
    console.log(arr)

}

delStr('aaa bbb ccc eee fff')

/****************************************************************************************/

/* 5. Дан массив:

[
	[1, 2, 3],
	[4, 5, 6],
	[7, 8, 9],
]
Найдите сумму элементов этого массива. */

const arr5 = [
	[1, 2, 3],
	[4, 5, 6],
	[7, 8, 9],
]

console.log(arr5.flat().reduce((acc, subArr) => acc + subArr, 0))

// Метод flat превращает многомерный массив в одномерный, а reduce суммирует элементы.